Revit 2023 API
FabricArea.FabricAreaType Property
 The type of the Fabric Area.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2013
Syntax
C#
public FabricAreaType FabricAreaType { get; }
Visual Basic
Public ReadOnly Property FabricAreaType As FabricAreaType
	Get
Visual C++
public:
property FabricAreaType^ FabricAreaType {
	FabricAreaType^ get ();
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace